## Pair Programming Limpieza I
### Modulo 2 Sprint 2
#### Lola Rubio y Judith Mellidez

1. Al empezar a trabajar con este dataframe ya eliminamos algunas columnas que a priori no nos interesaban.

Ahora llega el momento de eliminar alguna columna m√°s.

En este caso tendr√©is que eliminar las columnas que no nos sean √∫tiles para contestar a nuestras preguntas.

Pero ojo ‚ö†Ô∏è, haced una copia del dataframe para no "cargarnos" el dataframe original y perder la info.

In [2]:
import pandas as pd
import re
import numpy as np

In [5]:
df = pd.read_csv('attacks_pandas_7.csv',index_col = 0)
df.head(2)
pd.options.display.max_columns=None

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,injury,date,month,fatal,sex
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,"FATAL, all onboard were killed by sharks",1800,NaN,Y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,FATAL,Reported May-28-1797,May,Y,NaN

In [18]:
df_copy = df.copy()
df_copy.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'age', 'time', 'species_', 'href', 'injury', 'date',
       'month', 'fatal', 'sex'],
      dtype='object')

In [19]:
#Creamos una lista con los elementos que queremos eliminar para incluirla dentro del metodo '.drop'
eliminar_columnas = ['area','location','activity','name','href','injury','time','date']

In [20]:
df_copy.drop(eliminar_columnas,axis = 1,inplace=True)
df_copy.head(2)

    case_number    year        type     country  age species_ month fatal  sex
0    1800.00.00  1800.0  Unprovoked  SEYCHELLES  NaN      NaN   NaN     Y    F
1  1797.05.28.R  1797.0  Unprovoked         NaN  NaN      NaN   May     Y  NaN

2. ¬øHay valores duplicados en nuestro dataframe? En caso de que los haya, elimin√°ndlos.

In [21]:
df_copy.duplicated().sum()

0

In [22]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1672 entries, 0 to 1671
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   case_number  1672 non-null   object
 1   year         1672 non-null   float64
 2   type         1672 non-null   object
 3   country      1662 non-null   object
 4   age          1518 non-null   object
 5   species_     1546 non-null   object
 6   month        1518 non-null   object
 7   fatal        1576 non-null   object
 8   sex          1657 non-null   object
dtypes: float64(1), object(8)
memory usage: 195.2+ KB

3. Como hemos visto, algunas columnas no tienen el tipo de datos que deber√≠an. Cambiad el tipo de dato para la columna de year.

In [24]:
df_copy['year'] = df['year'].astype('int64', errors = 'ignore')
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1672 entries, 0 to 1671
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   case_number  1672 non-null   object
 1   year         1672 non-null   int64
 2   type         1672 non-null   object
 3   country      1662 non-null   object
 4   age          1518 non-null   object
 5   species_     1546 non-null   object
 6   month        1518 non-null   object
 7   fatal        1576 non-null   object
 8   sex          1657 non-null   object
dtypes: int64(1), object(8)
memory usage: 195.2+ KB

4. En la columna de country poner todos los valores en min√∫sculas.

üí° Pista Tendr√©is que usar una funci√≥n o una lambda üí°

In [32]:
# Hacemos la funci√≥n 
def minusculas(x): 
      col=col.lower()
      return col

In [33]:
df_copy['country']= df_copy['country'].apply(minusculas) 
df_copy.head()

    case_number  year        type     country  age species_ month fatal  sex
0    1800.00.00  1800  Unprovoked  seychelles  NaN      NaN   NaN     Y    F
1  1797.05.28.R  1797  Unprovoked         NaN  NaN      NaN   May     Y  NaN
2    1792.09.12  1792    Provoked     england  NaN      NaN   Sep     Y    M
3    1791.00.00  1791  Unprovoked   australia  NaN      NaN   NaN     Y    F
4    1788.05.10  1788        Boat   australia  NaN      NaN   May     N  NaN

5. Guardamos el csv para seguir trabajando en el siguiente ejercicio de pair de limpieza.

In [34]:
df_copy.to_csv('attacks_limpieza1.csv',index = False)